* Vector maps
** DONE [#A] Implement SQL-style filtering
   SCHEDULED: <2009-06-20 Sat> DEADLINE: <2009-06-26 Fri> CLOSED: [2009-06-26 Fri 16:55]
** DONE [#A] Implement filter by type
   SCHEDULED: <2009-06-20 Sat> DEADLINE: <2009-06-26 Fri> CLOSED: [2009-06-26 Fri 16:55]
** DONE [#A] Deploy sotm-vectormaps
   SCHEDULED: <2009-07-01 Wed> DEADLINE: <2009-07-01 Wed> CLOSED: [2009-07-01 Wed 11:44]
** DONE [#A] Implement downloading of data in demo.py
   SCHEDULED: <2009-07-01 Wed> DEADLINE: <2009-07-01 Wed> CLOSED: [2009-07-01 Wed 20:23]
** DONE [#A] Implement reading of bbox
   SCHEDULED: <2009-07-02 Thu> DEADLINE: <2009-07-02 Thu> CLOSED: [2009-07-03 Fri 12:07]
** DONE [#A] Implement reading of styles
   SCHEDULED: <2009-07-07 Tue> DEADLINE: <2009-07-08 Wed> CLOSED: [2009-07-16 Thu 11:17]
** DONE [#A] Implement clearing of XPath search
   SCHEDULED: <2009-07-07 Tue> DEADLINE: <2009-07-07 Tue> CLOSED: [2009-07-07 Tue 15:38]
** DONE [#A] Implement naming of ways
   DEADLINE: <2009-08-07 Fri> SCHEDULED: <2009-09-07 Mon> CLOSED: [2009-08-31 Mon 11:47]
** DONE [#A] Implement filtering by style
   SCHEDULED: <2009-07-28 Tue> DEADLINE: <2009-08-04 Tue> CLOSED: [2009-08-31 Mon 11:47]
** DONE [#A] Tiling
   SCHEDULED: <2009-08-05 Wed> DEADLINE: <2009-08-11 Tue> CLOSED: [2009-08-31 Mon 11:47]
** DONE [#A] Add switching on/off of tags and groups of tags
   SCHEDULED: <2009-07-06 Mon> DEADLINE: <2009-07-06 Mon> CLOSED: [2009-07-06 Mon 19:09]
** DONE [#A] Add XPath search to demo
   SCHEDULED: <2009-07-06 Mon> DEADLINE: <2009-07-07 Tue> CLOSED: [2009-07-16 Thu 11:17]
** DONE [#A] Implement Python API for new sotm-vectormaps
   SCHEDULED: <2009-07-01 Wed> DEADLINE: <2009-07-01 Wed> CLOSED: [2009-07-01 Wed 20:23]*
* DONE Fix issue with caching tiles
  SCHEDULED: <2009-09-02 Wed> CLOSED: [2009-09-02 Wed 17:30]
  - State "DONE"       from "WORKING"    [2009-09-02 Wed 17:30]
  - State "WORKING"    from "TODO"       [2009-09-02 Wed 14:35]
  
* DONE Add support for exclude API
  SCHEDULED: <2009-09-03 Thu> DEADLINE: <2009-09-16 Wed> CLOSED: [2009-09-15 Tue 14:56]
  - State "DONE"       from "WORKING"    [2009-09-15 Tue 14:56]
  CLOCK: [2009-09-04 Fri 17:44]--[2009-09-04 Fri 18:33] =>  0:49
  CLOCK: [2009-09-04 Fri 16:55]--[2009-09-04 Fri 17:31] =>  0:36
  CLOCK: [2009-09-03 Thu 17:32]--[2009-09-03 Thu 17:55] =>  0:23
  CLOCK: [2009-09-03 Thu 16:29]--[2009-09-03 Thu 17:09] =>  0:40
  CLOCK: [2009-09-03 Thu 14:24]--[2009-09-03 Thu 15:05] =>  0:41
  - State "WORKING"    from "TODO"       [2009-09-03 Thu 14:23]
* DONE Move tags filtering into SQL request
  SCHEDULED: <2009-09-15 Tue> DEADLINE: <2009-09-16 Wed> CLOSED: [2009-09-21 Mon 12:11]
  - State "DONE"       from "WORKING"    [2009-09-21 Mon 12:11]
  CLOCK: [2009-09-18 Fri 11:42]--[2009-09-18 Fri 18:42] => 7:00
  - State "WORKING"    from "TODO"       [2009-09-15 Tue 17:45]
* PAUSED Integrate coastlines into PostGIS			     :PAUSED:
  SCHEDULED: <2009-09-21 Mon> DEADLINE: <2009-09-24 Thu>
  - State "PAUSED"     from "WORKING"    [2009-09-29 Tue 17:23] \\
    paused while i'm investigating performance
  - State "WORKING"    from "TODO"       [2009-09-24 Thu 13:04]
* DONE Add docs and examples
  SCHEDULED: <2009-09-18 Fri> DEADLINE: <2009-09-23 Wed> CLOSED: [2009-09-29 Tue 17:23]
  - State "DONE"       from "WORKING"    [2009-09-29 Tue 17:23]
  CLOCK: [2009-09-22 Tue 11:21]
  CLOCK: [2009-09-21 Mon 12:11]--[2009-09-21 Mon 16:46] =>  4:35
  - State "WORKING"    from "WORKING"    [2009-09-21 Mon 12:11]
  - State "WORKING"    from "TODO"       [2009-09-18 Fri 11:41]
* DONE Add non-clause variant of vectormaps API
  SCHEDULED: <2009-09-22 Tue> DEADLINE: <2009-09-22 Tue> CLOSED: [2009-09-24 Thu 13:04]
  - State "DONE"       from "TODO"       [2009-09-24 Thu 13:04]
* DONE Blocker to dkorochkin for vector maps deployment
  SCHEDULED: <2009-09-22 Tue> DEADLINE: <2009-09-23 Wed> CLOSED: [2009-09-29 Tue 17:35]
  - State "DONE"       from "WORKING"    [2009-09-29 Tue 17:35]
  - State "WORKING"    from "TODO"       [2009-09-24 Thu 13:04]
  [2009-09-22 Tue]
  
